In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Introduction to pandas Data Structures

### Series
A Series is a one-dimensional array-like object containing a sequence of values (of
similar types to NumPy types) and an associated array of data labels, called its index.

In [2]:
obj = np.array([4, 7, -5, 3])
pd.Series(obj)

0    4
1    7
2   -5
3    3
dtype: int32

In [3]:
obj = pd.Series([4, 7, -5, 3])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj_2 = pd.Series([4, 7, -5, 3], index = ['a', 'b', 'c', 'd'])

In [6]:
obj_2

a    4
b    7
c   -5
d    3
dtype: int64

In [7]:
obj_2.index = ['x', 'n', 'p', 'z']

In [8]:
obj_2

x    4
n    7
p   -5
z    3
dtype: int64

In [9]:
obj_2.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

we can use labels in the index when selecting single
values or a set of values:

In [10]:
obj_2['x']

4

In [11]:
obj_2[['x', 'n']] # Multi-Indexing

x    4
n    7
dtype: int64

In [12]:
obj_2[obj_2 > 0]

x    4
n    7
z    3
dtype: int64

In [13]:
obj_2 * 2

x     8
n    14
p   -10
z     6
dtype: int64

When you are only passing a dict, the index in the resulting Series will have the dict’s
keys in sorted order

In [14]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj_3 = pd.Series(sdata)
obj_3 # index will be keys of dictionary

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

we can override this by passing the dict keys in the order you
want them to appear in the resulting Series:

In [16]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj_4 = pd.Series(sdata, index = states)
obj_4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [17]:
obj_4['Ohio']

35000.0

A Series can be converted back to a dictionary with its to_dict method:

In [18]:
obj_4.to_dict()

{'California': nan, 'Ohio': 35000.0, 'Oregon': 16000.0, 'Texas': 71000.0}

The
isnull and notnull functions in pandas should be used to detect missing data:

In [19]:
obj_4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
obj_4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
obj_4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
obj_3 + obj_4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

A Series’s index can be altered in-place by assignment:

In [23]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

Both the Series object itself and its index have a name attribute, which integrates with
 other areas of pandas functionality:

In [24]:
obj_4.name = 'Population'
obj_4.index.name = 'State'
obj_4

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

### DataFrame
A DataFrame represents a rectangular table of data and contains an ordered collection
of columns, each of which can be a different value type (numeric, string,
boolean, etc.).

In [25]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)

In [26]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [27]:
df.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [28]:
df.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

If you specify a sequence of columns, the DataFrame’s columns will be arranged in
that order:

In [29]:
pd.DataFrame(data, columns=['pop', 'year', 'state'])

   pop  year   state
0  1.5  2000    Ohio
1  1.7  2001    Ohio
2  3.6  2002    Ohio
3  2.4  2001  Nevada
4  2.9  2002  Nevada
5  3.2  2003  Nevada

If you pass a column that isn’t contained in the dict, it will appear with missing values
in the result:

In [30]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
        index=['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [31]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

A column in a DataFrame can be retrieved as a Series either by dict-like notation or
by attribute:

In [32]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [33]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

Rows can also be retrieved by position or name with the special loc attribute (much
more on this later):

In [34]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [35]:
frame2.loc['two':, 'state':]

        state  pop debt
two      Ohio  1.7  NaN
three    Ohio  3.6  NaN
four   Nevada  2.4  NaN
five   Nevada  2.9  NaN
six    Nevada  3.2  NaN

In [36]:
frame2.loc['one':'three', 'year':'state']

       year state
one    2000  Ohio
two    2001  Ohio
three  2002  Ohio

Columns can be modified by assignment. For example, the empty 'debt' column
could be assigned a scalar value or an array of values:

In [37]:
frame2['debt'] = 0

In [38]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     0
three  2002    Ohio  3.6     0
four   2001  Nevada  2.4     0
five   2002  Nevada  2.9     0
six    2003  Nevada  3.2     0

In [39]:
frame2['debt'] = np.arange(6.)

In [40]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [41]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [42]:
del frame2['debt']

The column returned from indexing a DataFrame is a view on the
 underlying data, not a copy. Thus, any in-place modifications to
 the Series will be reflected in the DataFrame. The column can be
 explicitly copied with the Series’s copy method

In [43]:
frame2.columns

Index(['year', 'state', 'pop'], dtype='object')

Another common form of data is a nested dict of dicts:

In [44]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [45]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [46]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

As with Series, the values attribute returns the data contained in the DataFrame as a
two-dimensional ndarray:

In [47]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [48]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5],
       [2001, 'Ohio', 1.7],
       [2002, 'Ohio', 3.6],
       [2001, 'Nevada', 2.4],
       [2002, 'Nevada', 2.9],
       [2003, 'Nevada', 3.2]], dtype=object)

### Index Objects
pandas’s Index objects are responsible for holding the axis labels and other metadata
(like the axis name or names).
![index_methods](Assets/index_methods.png)

In [49]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [50]:
index = obj.index

In [51]:
index[1:]

Index(['b', 'c'], dtype='object')

In [52]:
labels = pd.Index(np.arange(3))

In [53]:
obj_0 = pd.Series([1.5, -2.5, 0], index=labels)

In [54]:
obj_0

0    1.5
1   -2.5
2    0.0
dtype: float64